const Practice = () => {
  return <div>Practice</div>;
};

export default Practice;
// ****************************************
// Проект Витрина в NextJS
// Давайте реализуем проект с витриной интернет-магазина.

// Витрина должна представлять собой плиточку из карточек товаров. В каждой карточке должна быть картинка товара, название товара и его цена.

// Карточка должна быть ссылкой, ведущей на страницу товара. На странице товара должно быть полное описание товара.

// №1⊗jsnxPmPrjSC

// Сделайте файл с многомерной структурой данных, в которой будут хранится товары.

// №2⊗jsnxPmPrjSC

// На главной странице сайта выведите список всех товаров нашей витрины.

// №3⊗jsnxPmPrjSC

// Реализуйте страницу товара.
// ****************************************
// Проект Страны-Города в NextJS
// Давайте реализуем проект со странами и городами, а также их описаниями.

// Описание страны должно включать в себя язык страны, площадь, количество населения.

// Для каждой страны нужно хранить массив городов этой страны.

// Описание города должно включать в себя площадь, количество населения, год основания.

// №1⊗jsnxPmPrjCC

// Сделайте файл с многомерной структурой данных, в которой будут хранится страны и их города.

// №2⊗jsnxPmPrjCC

// На главной странице сайта выведите список всех стран в виде ссылок на страницы стран.

// №3⊗jsnxPmPrjCC

// На странице страны выведите описание страны, а также список ее городов в виде ссылок на страницы городов.

// №4⊗jsnxPmPrjCC

// На странице города выведите описание города, а также ссылку на страницу страны данного города.
