"use client";

import { useState } from "react";

const TutorialNextJS = () => {
  const [openIndex, setOpenIndex] = useState<number | null>(null);
  return (
    <div>
      <h2>Вступ до фреймворку NextJS</h2>
      <p>
        NextJS — фреймворк для веб-розробки з відкритим кодом, написаний на базі
        React. До основних переваг NextJS належать вбудована маршрутизація,
        оптимізований рендеринг як на стороні клієнта, так і сервера, зручна
        збірка додатка для роботи в продакшні. Завдяки сучасній архітектурі
        веб-розробки, заснованій на JavaScript, API та попередньо відрендереній
        розмітці, NextJS працює швидше та ефективніше за React.
      </p>
      <p>
        Цей фреймворк використовується для створення різноманітних
        повнофункціональних веб-додатків — від односторінкових сайтів до
        соціальних мереж та інтернет-магазинів.
      </p>
      <p>
        У цьому підручнику розглядаються основні аспекти роботи з фреймворком
        NextJS. Однак для його вивчення вам необхідно знати чистий JavaScript,
        роботу з React, основи командного рядка, роботу з npm та npx, роботу з
        модулями ES6, основи роботи з протоколом HTTP, роботу з компілятором
        Vite.
      </p>
      {/* ****************************************************************************** */}
      <h2>Проблема SEO та фреймворк NextJS</h2>
      <p>
        Коли ми розробляємо сайт, нам важливо розуміти, чи будемо ми просувати
        цей сайт у пошукових системах. Під пошуковими системами маються на увазі
        спеціалізовані сайти на кшталт Google чи Yandex, на яких користувач
        шукає потрібну йому інформацію
      </p>
      <p>
        Коли ми розробляємо сайт, нам важливо розуміти, чи будемо ми просувати
        цей сайт у пошукових системах. Під пошуковими системами маються на увазі
        спеціалізовані сайти на кшталт Google чи Yandex, на яких користувач
        шукає потрібну йому інформацію.
      </p>
      <p>
        І тут на нас чекає проблема: сайти, розроблені на React, не будуть
        просуватися в пошукових системах. Справа в тому, що вміст сторінок
        такого сайту генерується динамічно в браузері за допомогою JavaScript.
        Пошукові системи поки що не вміють обробляти такі сторінки. Відповідно,
        такий сайт не зможе повноцінно відображатися за пошуковими запитами.
      </p>
      <p>
        Щоб пошукові системи могли повноцінно працювати з нашим сайтом, тексти
        його сторінок мають створюватися на стороні сервера та надсилатися до
        браузера у вигляді готового HTML-коду.
      </p>
      <p>
        Саме цю проблему вирішує фреймворк NextJS. Він дозволяє писати код JSX
        на серверній стороні. Сервер перетворює цей JSX на звичайний HTML і
        надсилає його до браузера. Таким чином, на клієнтську сторону
        надсилатиметься HTML- код, необхідний для коректної роботи пошукових
        систем із нашим сайтом.
      </p>
      <p>Як саме це робиться, ми й будемо вивчати в рамках цього підручника.</p>
      <p>
        Слід зазначити, що пошукові системи вже навчаються розпізнавати вміст,
        згенерований на JavaScript. Коли вони повністю опанують цю навичку, вся
        розробка веб-сайтів докорінно зміниться. І фреймворки на кшталт NextJS
        або взагалі не будуть потрібні, або стануть зовсім іншими за своїми
        принципами ..
      </p>
      <p>Ну що ж, поїхали :)</p>
      {/* ****************************************************************************** */}
      <h2>Типи рендерингу коду</h2>
      <p>
        Рендеринг — процес створення остаточного HTML-коду, який буде оброблений
        браузером.
      </p>
      <h4>Існує два основних типи рендерингу:</h4>
      <ul>
        <li>серверний, скорочено SSR (серверне рендеринг)</li>
        <li>клієнтський, скорочено CSR (client-side rendering)</li>
      </ul>
      <p>
        У разі серверного рендерингу HTML-код створюється на сервері, а потім
        надсилається до браузера. У разі клієнтського рендерингу HTML-код
        динамічно генерується в браузері за допомогою JavaScript.
      </p>
      <p>Обидва способи мають свої переваги та недоліки.</p>
      <h3>Особливості SSR:</h3>
      <p>
        HTML-код генерується на сервері для кожного запиту. Це збільшує
        навантаження на сервер. Користувач одразу отримує готову сторінку, що
        робить сторінку доступною ще до того, як JavaScript завантажиться та
        виконається. SEO-оптимізація: пошукові системи зможуть правильно
        індексувати сайт.
      </p>
      <h3>Особливості CSR:</h3>
      <p>
        Продуктивність: якщо браузер зайнятий роботою, наприклад, обробкою
        даних, це уповільнює інші процеси, наприклад, побудову дерева DOM. У цей
        час користувачі можуть бачити порожній екран.
      </p>
      <p>
        Безпека: дані, що зберігаються на стороні клієнта, легко можуть бути
        виявлені під час перегляду сторінки в налагоджувачі браузера. Тому не
        можна працювати з важливою інформацією, наприклад, з паролями або
        особистими даними зареєстрованих користувачів на стороні клієнта.
      </p>
      <p>
        Зменшується навантаження на сервер: серверу не потрібно створювати
        HTML-код для кожного нового запиту.
      </p>
      <p>
        Зменшується навантаження на інтернет-канал: у разі клієнтського
        рендерингу від сервера до браузера потрібно передати менший обсяг
        тексту.
      </p>
      <ol>
        <li>
          <h3
            onClick={() => setOpenIndex(openIndex === 1 ? null : 1)}
            style={{ cursor: "pointer" }}
          >
            Розкажіть, які переваги та недоліки має SSR.
          </h3>

          {openIndex === 1 && (
            <p>
              <strong>Переваги SSR.</strong>
              <br />
              - Швидке перше завантаження сторінки
              <br />
              - Краще SEO
              <br />
              - Готовий HTML-код одразу надсилається користувачеві
              <br />
              - Краще працює на слабких пристроях
              <br />
              <strong>Недостатки SSR</strong> <br />
              - Більше навантаження на сервер <br />
              - Складніша розробка
              <br />
              - Можливі hydration errors <br />
              - Деякі API браузера (window, document) не працюють на сервері
              <br />
              <strong>
                SSR підходить для SEO та публічних сайтів, але ускладнює
                розробку.
              </strong>
            </p>
          )}
        </li>
        <li>
          <h3
            onClick={() => setOpenIndex(openIndex === 2 ? null : 2)}
            style={{ cursor: "pointer" }}
          >
            Розкажіть, які переваги та недоліки має CSR.
          </h3>

          {openIndex === 2 && (
            <p>
              <strong>Переваги CSR</strong>
              <br />
              - Швидкі переходи між сторінками
              <br />
              - Менше навантаження на сервер
              <br />
              - Добре підходить для SPA та додатків
              <br />
              - Більш інтерактивний інтерфейс
              <br />
              <strong>Недоліки CSR</strong>
              <br />
              - Повільне перше завантаження
              <br />
              - Неефективне SEO без додаткового налаштування
              <br />
              Користувач може бачити білий екран до завантаження JS
              <br />
              Більше навантажує браузер користувача
              <br />
              <strong>
                CSR зручний для додатків та особистих кабінетів, але гірший для
                SEO та першого завантаження.
              </strong>
            </p>
          )}
        </li>
        <li>
          <h3
            onClick={() => setOpenIndex(openIndex === 3 ? null : 3)}
            style={{ cursor: "pointer" }}
          >
            Припустимо, ви створюєте сайт. Цей сайт не потрібно просувати в
            пошукових системах, і при цьому важливо зменшити навантаження на
            сервер. Який тип рендерингу підійде найкраще?
          </h3>

          {openIndex === 3 && <p>CSR</p>}
        </li>
        <li>
          <h3
            onClick={() => setOpenIndex(openIndex === 4 ? null : 4)}
            style={{ cursor: "pointer" }}
          >
            Припустимо, ви створюєте сайт. Цей сайт потрібно просувати в
            пошукових системах. Який тип рендерингу підійде найкраще?
          </h3>

          {openIndex === 4 && <p>SSR</p>}
        </li>
      </ol>
      {/* ================================================================================= */}
      <h2>Типы React компонентов в NextJS</h2>
      <p>
        У класичному React рендеринг відбувається на стороні клієнта, що створює
        проблему з SEO. Тому розробники React вирішили зробити так, щоб React
        підтримував не тільки клієнтський рендеринг, а й серверний.
        <br />
        Для цього в React запровадили два типи компонентів: клієнтські (RCC) та
        серверні (RSC).
        <br />
        Серверні компоненти рендеряться на сервері, а результат рендерингу
        відправляється в браузер у вигляді HTML-коду. Клієнтські компоненти
        рендеряться прямо в браузері.
        <br />
        У серверних компонентах ми можемо використовувати JSX, але не можемо
        використовувати хуки для роботи з DOM (типу useState), а також
        звертатися до тих команд JavaScript, які доступні тільки в браузері.
        Натомість ми можемо використовувати NodeJS, наприклад, щоб читати вміст
        файлів, або звертатися до бази даних.
        <br />
        Клієнтські компоненти — це фактично ті компоненти, до яких ми звикли під
        час вивчення React. У них ми можемо використовувати і JSX, і хуки для
        роботи з DOM.
        <br />
        Щоб оголосити компонент клієнтським, на початку файлу компонента
        потрібно написати спеціальну директиву `use client`. Ось приклад коду
        клієнтського компонента:
      </p>
      <pre>
        <code>
          {`'use client';

import { useState } from 'react';

export default function Test() {
	let [name, setName] = useState('user');
	
	return (
		<div>
			<p>hello, {name}!</p>
		</div>
	);
}`}
        </code>
      </pre>
      <p>
        Щоб оголосити компонент серверним, на початку файлу компонента потрібно
        написати спеціальну директиву `use server`. Ось приклад коду серверного
        компонента:
      </p>
      <pre>
        <code>
          {`'use server';

export default function Test() {
	let name = 'user';
	
	return (
		<div>
			<p>hello, {name}!</p>
		</div>
	);
}`}
        </code>
      </pre>
      <p>
        NextJS підтримує обидва типи компонентів. За замовчуванням усі
        компоненти є серверними, і директиву `use server` у них можна не
        вказувати.
        <br />
        Вивчення NextJS ми почнемо з серверних компонентів. А потім додамо
        клієнтські.
      </p>
      <ol>
        <li>
          <h3
            onClick={() => setOpenIndex(openIndex === 5 ? null : 5)}
            style={{ cursor: "pointer" }}
          >
            Що таке RCC у React?
          </h3>

          {openIndex === 5 && (
            <p>
              RCC у React зазвичай означає React Class Component — класовий
              компонент.
              <br />
              Раніше їх часто використовували, а зараз переважно пишуть на
              функціональних компонентах із hooks.
              <br />
              React class components зараз вважаються застарілим підходом
            </p>
          )}
        </li>
        <li>
          <h3
            onClick={() => setOpenIndex(openIndex === 6 ? null : 6)}
            style={{ cursor: "pointer" }}
          >
            Що таке RSC у React?
          </h3>
          {openIndex === 6 && (
            <p>
              RSC (React Server Components) — це компоненти React, які
              виконуються на сервері, а не в браузері.
              <br />
              Головне:
              <br />
              - Рендериться на сервері
              <br />
              - Не потрапляють у JS-бандл клієнта
              <br />
              - Не використовують useState, useEffect та браузерні API
              <br />- Можуть безпосередньо звертатися до Бази Даних / API на
              сервері
            </p>
          )}
        </li>
        <li>
          <h3
            onClick={() => setOpenIndex(openIndex === 7 ? null : 7)}
            style={{ cursor: "pointer" }}
          >
            Як у React оголосити клієнтський компонент?
          </h3>
          {openIndex === 7 && (
            <p>
              У React (і особливо в Next.js) клієнтський компонент оголошується
              через директиву: `use client`
            </p>
          )}
        </li>
        <li>
          <h3
            onClick={() => setOpenIndex(openIndex === 8 ? null : 8)}
            style={{ cursor: "pointer" }}
          >
            Як у React оголосити серверний компонент?
          </h3>
          {openIndex === 8 && (
            <p>
              У React (точніше в Next.js App Router) серверний компонент — це
              компонент без `use client`. Як оголосити: <br />
              👉 просто нічого не додаєш <br />
            </p>
          )}
        </li>
        <li>
          <h3
            onClick={() => setOpenIndex(openIndex === 9 ? null : 9)}
            style={{ cursor: "pointer" }}
          >
            Чи працюватиме хук useState у серверному компоненті?
          </h3>
          {openIndex === 9 && (
            <p>❌ Ні, useState у серверному компоненті не працює.</p>
          )}
        </li>
        <li>
          <h3
            onClick={() => setOpenIndex(openIndex === 10 ? null : 10)}
            style={{ cursor: "pointer" }}
          >
            Чи працюватиме в серверному компоненті метод querySelector у
            JavaScript?
          </h3>
          {openIndex === 10 && (
            <p>❌ Ні, querySelector у серверному компоненті не працює.</p>
          )}
        </li>
      </ol>
      {/* ================================================================================= */}
      <h2>Діалект JavaScript у фреймворку NextJS</h2>
      <p>
        Діалект JavaScript у фреймворку NextJS Розробку в NextJS можна вести або
        на чистому JavaScript, або на TypeScript. Діалект мови можна буде обрати
        під час встановлення NextJS.
        <br />
        Наразі популярнішою є розробка на TypeScript. Для простоти, однак, ми
        почнемо вивчення з чистого JavaScript, а потім в окремому розділі
        підручника ми поговоримо про те, що потрібно буде змінити в нашому коді,
        щоб перейти на TypeScript.
      </p>
      {/* ================================================================================= */}
      <h2>Документація фреймворку NextJS</h2>
      <p>
        Цей підручник побудований так, щоб за ним було легко й просто навчатися.
        Тому я опускаю певну частину інформації. Після опрацювання підручника
        обов’язково прочитайте всю офіційну документацію NextJS.
        <br />
        Майте на увазі, що за замовчуванням у прикладах коду документації буде
        TypeScript, але ви можете перейти на JavaScript.
        <br />
        Також до документації є сенс звертатися і під час читання цього
        підручника. Особливо, якщо щось, описане в підручнику, не працює або
        працює не так, як треба. У цьому випадку документація є першоджерелом, в
        якому слід перевіряти прочитане.
      </p>
      {/* ================================================================================= */}
      <h2>Установка фреймворка NextJS</h2>
      <p>
        У цьому уроці ми встановимо NextJS. Для встановлення цього фреймворку
        вам знадобиться NodeJS версії 22 або вище.
        <br />
        Для запуску встановлення в терміналі потрібно виконати таку команду:
        <br />
        npx create-next-app@latest <br />
        Після цього розпочнеться процес встановлення, і вам буде запропоновано
        відповісти на низку запитань, за допомогою яких буде налаштовано ваш
        фреймворк.
        <br />
        Запитання Відповідь <br />
        What is your project named? Тут нам потрібно вказати назву нашого
        проєкту. Можна вказати будь-яку. Напишіть my-app. <br />
        Would you like to use TypeScript? Тут нам пропонується використовувати
        TypeScript. Ми не будемо цього робити, оскільки поки що для простоти ми
        будемо працювати на JavaScript. <br />
        Вибирайте No. <br />
        Would you like to use ESLint? ESLint — це спеціальна бібліотека, яка
        перевіряє відповідність вашого коду стандартам оформлення. <br />
        Вибирайте Yes. <br />
        Would you like to use Tailwind CSS? Tailwind — це спеціальний
        CSS-фреймворк для React. <br />
        Вибирайте Yes. <br />
        Would you like to use `src/` directory? Тут запитується, чи хочемо ми,
        щоб наш проект був у папці src. <br />
        Вибирайте Yes. <br />
        Would you like to use App Router? Включає сучасний варіант
        маршрутизації. <br />
        Виберіть Yes. <br />
        Would you like to customize the default import alias (@/*)? Ця настройка
        дозволяє спростити шляхи до файлів при використанні імпорту файлів.{" "}
        <br />
        Виберіть Yes. <br />
        Після відповідей на всі запропоновані питання запуститься установка
        фреймворку. Коли проект буде створено, перейдіть до його папки: <br />
        cd my-app
      </p>
      <ol>
        <li>Створіть проєкт на NextJS.</li>
      </ol>

      {/* ================================================================================= */}

      <h2>Режими компіляції в NextJS</h2>
      <p>
        У попередньому уроці ми встановили фреймворк. Тепер нам потрібно
        запустити наш проєкт.
        <br />
        Однак перед цим давайте обговоримо доступні нам режими збірки. У NextJS
        є два режими: режим розробки та режим продакшну.
        <br />
        Коли ви розробляєте свій проєкт на локальному комп’ютері, вам потрібно
        запускати його в режимі розробки. У цьому режимі фреймворк працюватиме у
        зручний для програміста спосіб.
        <br />
        Коли проект буде готовий, його потрібно буде викласти на хостинг, щоб
        він був доступний через Інтернет. У цьому випадку нам потрібно буде
        зібрати його в режимі продакшну.
        <br />У наступних уроках ми обговоримо особливості цих двох варіантів
        збірки.
      </p>

      {/* ================================================================================= */}

      <h2>Режим разработки в NextJS</h2>

      <p>
        Режим розробки призначений для того, щоб зробити процес написання коду
        та його тестування зручним і гнучким. У цей режим включені інструменти,
        що дозволяють виявляти помилки, тестувати та швидко вносити необхідні
        зміни до коду.
        <br />
        Основні особливості режиму розробки:
        <br />
        Гаряче перезавантаження — при внесенні будь-якої зміни в код сервер
        автоматично перезавантажується, а сторінка з кодом оновлюється.
        <br />
        Виведення помилок на сторінці в браузері для того, щоб було зручніше їх
        побачити та усунути. Також у браузері показується місцезнаходження
        файлів з помилками, що полегшує їх пошук.
        <br />
        Код не оптимізується для максимальної продуктивності, тому можуть бути
        додаткові перевірки, попередження і навіть трохи повільніше відбувається
        завантаження сторінок.
        <br />
        Деталізований вивід логів у терміналі, щоб було простіше відстежити те,
        що відбувається на сервері.
        <br />
        Режим розробки запускається наступною командою:
        <br />
        <strong>npm run dev</strong>
        <br />
        Після чого в терміналі з`явиться адреса, перейшовши за якою можна
        побачити свій проєкт.
        <br />
        Для виходу з режиму розробника необхідно натиснути комбінацію клавіш{" "}
        <strong>CTRL+C</strong>.
      </p>

      <ol>
        <li>Запустіть ваш проєкт у режимі розробки.</li>
        <li>Відкрийте свій проєкт у браузері..</li>
      </ol>

      {/* ================================================================================= */}
    </div>
  );
};

export default TutorialNextJS;

// ************************************
{
  /*

Режиме продакшена в фреймворке NextJS
Режим продакшена предназначен для запуска проекта на хостинге. Основная цель этого режима состоит в том, чтобы обеспечить максимальную производительность и безопасность проекта, а также сократить объем подгружаемых файлов для экономии системной памяти.

Основные особенности режима продакшена:

Оптимизация кода - перед запуском в продакшене код компилируется. Например, выполняется минимизация JavaScript и CSS для уменьшения их размера и ускорения загрузки страницы.
Статическая генерация - фреймворк заранее генерирует страницы, что ускоряет их загрузку на сайте.
Оптимизация изображений, которые автоматически сжимаются и подгоняются для разных размеров экрана и устройств.
Удаление отладочной информации - весь код для отладки ошибок убирается со страниц браузера. Это необходимо для безопасной работы проекта и скрытия информации о структуре файлов от пользователей.
Отсутствие горячей перезагрузки - в отличие от режима разработки, здесь нет автоматической перезагрузки при каждом внесенном изменении.
Режим продакшена запускается двумя командами. Для начала нужно выполнить продакшн-сборку проекта:

npm run build
А затем запустить собранный проект:

npm start
После запуска проекта вы увидите информацию об основной структуре проекта. Специальными символами отмечаются типы контента проекта - статический и динамический. На данный момент у нас есть только статический контент.

№1⊗jsnxPmBsPM

Для пробы запустите проект в режиме продакшена.

№2⊗jsnxPmBsPM

Выключите режим продакшена и включите режим разработки. Далее в уроках мы будем работать именно в этом режиме.
************************************
Файловая структура проекта в фреймворке NextJS
После создания проекта в его папке появится определенная файловая структура. Давайте рассмотрим ее самые важные компоненты:

/node_modules/
/src/
/app/
globals.css
layout.jsx
page.jsx
next.config.mjs
package.json
tailwind.config.js
Файлы, которые мы сделаем в процессе работы с проектом будут хранится в папках src и src/app. На данный момент в папке src находится только одна рабочая папка app. А в ней хранятся файлы для работы с настройками CSS (global.css), файл с основной разметкой страницы (layout.jsx) и файл с основным роутом проекта (page.jsx).

В файле next.config.mjs содержатся основные настройки проекта.

В файле tailwind.config.js содержатся основные настройки для стилей Tailwind, применяемых в данном проекте.

№1⊗jsnxPmBsFS

Расскажите, какие папки содержат основные рабочие файлы проекта.

№2⊗jsnxPmBsFS

Расскажите, где задаются настройки для всего проекта.

№3⊗jsnxPmBsFS

Расскажите, в какой папке хранятся все установленные в проекте библиотеки и пакеты.

№4⊗jsnxPmBsFS

Расскажите, где задаются настройки для стилей Tailwind.
************************************
Основной принцип работы фреймворка NextJS
В предыдущих уроках мы установили фреймворк NextJS и познакомились с его базовой структурой. Пришло время заняться основной работой.

Основной частью NextJS является роутинг. Роутинг работает так: когда пользователь вбивает в адресную строку браузера какой-то URL, фреймворк NextJS будет отдавать в браузер определенный файл, соответствующий этому URL.

Роутинг в NextJS устроен особым образом. Его суть заключается в том, что каждому запрошенному URL соответствует некая папка внутри src/app.

При этом внутри папки должен быть файл с названием page.jsx. Именно этот файл и будет отдаваться в браузер. Причем в этом файле мы будем писать код на JSX, а в браузер будет отправляться готовый HTML код страницы.

Давайте посмотрим на примере. Пусть мы хотим, чтобы по URL /test/ отдавался некоторый текст.

Создадим соответствующую папку: src/app/test. Внутри этой папки сделаем файл page.jsx со следующим содержимым:

export default function Test() {
	return <h1>hello, user!</h1>;
}
Откройте в браузере наш URL: /test. И вы увидите текст, написанный нами внутри JSX файла.

Попробуйте поменяйте текст и сохраните файл. После этого текст автоматически поменяется и в браузере. Так работает NextJS в режиме разработки.

№1⊗jsnxPmBsInr

Сделайте так, чтобы при обращении на адрес / about в браузер выводилось сообщение с вашим именем и фамилией.
************************************
Серверные компоненты в фреймворке NextJS
Рассмотрим компонент, созданный нами в предыдущем уроке:

export default function Test() {
	return <h1>hello, user!</h1>;
}
Как уже упоминалось ранее, по умолчанию в NextJS все компоненты являются серверными. При этом нам доступны все возможности языка JSX, за исключением работы со стейтами и других аналогичных хуков.

Для примера давайте сделаем переменную и выведем ее в верстке:

export default function Test() {
	let name = 'user';
	return <h1>hello, {name}!</h1>;
}
№1⊗jsnxPmBsSC

Дан массив продуктов:

let prods = [
	'prod1',
	'prod2',
	'prod3',
];
С помощью цикла выведите эти продукты в виде списка ul внутри вашего серверного компонента.
************************************
Клиентские компоненты в фреймворке NextJS
Давайте теперь переделаем наш серверный компонент на клиентский. Для этого напишем в начале файла компонента директиву 'use client':

'use client';

export default function Test() {
	return <h1>hello, user!</h1>;
}
Теперь нам станут доступны стейты, создаваемые через useState. Давайте для примера создадим стейт и выведем его содержимое в верстке:

'use client';

import { useState } from 'react';

export default function Test() {
	let [name, setName] = useState('user');
	return <h1>hello, {name}!</h1>;
}
№1⊗jsnxPmBsSC

Сделайте клиентский компонент с двумя инпутами и кнопкой. Пусть в инпуты вводятся числа. По нажатию на кнопку выведите в абзац сумму введенных чисел.

№2⊗jsnxPmBsSC

Уберите директиву 'use client'. Убедитесь, что в этом случае NextJS выдаст ошибку про причине того, что нельзя использовать стейты внутри серверных компонентов.
************************************
Проверка контента в фреймворке NextJS
В предыдущих уроках мы попробовали сделать два типа компонентов - серверные и клиентские. Давайте убедимся в том, что в серверных компонентах решена проблема с SEO. To есть мы должны проверить, что в браузер приходит верстка с текстом нашего компонента. Сделаем это.

Пусть наш серверный компонент имеет следующий вид:

export default function Test() {
	let name = 'user';
	return <h1>hello, {name}!</h1>;
}
Откройте страницу с этим компонентом в браузере. Затем нажмите Ctrl + U. Это комбинация клавиш откроет исходный HTML код страницы. Это тот код, который приходит с сервера. To есть до применения к нему браузерного JavaScript. Именно так и видят нашу страницу поисковые системы. Итак, откройте исходный код и изучите его. Там вы найдете текст нашего компонента.

Давайте для примера теперь сделаем клиентский компонент:

'use client';

import { useState } from 'react';

export default function Test() {
	let [name, setName] = useState('user');
	return <h1>hello, {name}!</h1>;
}
Опять нажмите Ctrl + U и изучите исходный код. Вы не найдете текста нашего компонента, так его текст формируется динамически в браузере.

В этом и проявляется основная разница между серверными и клиентскими компонентами.

№1⊗jsnxPmBsSC

Проделайте описанные в уроки манипуляции.

№2⊗jsnxPmBsSC

Расскажите в чем разница между серверными и клиентскими компонентами с точки зрения SEO.

№3⊗jsnxPmBsSC

Помимо SEO, какие еще различия имеют клиентские и серверные компоненты?
************************************
*/
}
